archive/before-2018-11-10/2017-06-28-在一台服务器上手动布署20台虚拟机.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>在一台服务器上手动布署20台虚拟机</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">在一台服务器上手动布署20台虚拟机</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0593b65">1. virsh拉起虚拟机</a></li>
<li><a href="#orga82d4e6">2. 网络设置</a>
<ul>
<li><a href="#org15b2a1b">2.1. 网络拓扑</a></li>
<li><a href="#org8f9fa5b">2.2. 拉起的虚拟机的ip设置</a></li>
</ul>
</li>
<li><a href="#org71528e0">3. 瓶颈</a></li>
</ul>
</div>
</div>


<div id="outline-container-org0593b65" class="outline-2">
<h2 id="org0593b65"><span class="section-number-2">1</span> virsh拉起虚拟机</h2>
<div class="outline-text-2" id="text-1">
<p>
压力测试需要拉起20台机器做测试。云上拉起机器，磁盘可能不在本地，影响
测试结果。所以我们决定通过命令行工具 <code>virsh</code> 手动拉起20台机器。它能
根据 <code>xml</code> 文件来设置拉起机器的相应配置。使用下面的基本配置。
</p>
<div class="org-src-container">
<pre class="src src-xml">    &lt;<span style="color: #ffd700;">domain</span> <span style="color: #ff8700;">type</span>='kvm'&gt;
      &lt;<span style="color: #ffd700;">name</span>&gt;peng-test&lt;/<span style="color: #ffd700;">name</span>&gt;
      &lt;<span style="color: #ffd700;">memory</span>&gt;4194304&lt;/<span style="color: #ffd700;">memory</span>&gt;
      &lt;<span style="color: #ffd700;">currentMemory</span>&gt;4194304&lt;/<span style="color: #ffd700;">currentMemory</span>&gt;
      &lt;<span style="color: #ffd700;">vcpu</span>&gt;2&lt;/<span style="color: #ffd700;">vcpu</span>&gt;
      &lt;<span style="color: #ffd700;">os</span>&gt;
        &lt;<span style="color: #ffd700;">type</span>&gt;hvm&lt;/<span style="color: #ffd700;">type</span>&gt;
    <span style="color: #6c6c6c; font-style: italic;">&lt;!-- </span><span style="color: #6c6c6c; font-style: italic;">&#20174;&#30828;&#30424;&#21551;&#21160; </span><span style="color: #6c6c6c; font-style: italic;">--&gt;</span>
        &lt;<span style="color: #ffd700;">boot</span> <span style="color: #ff8700;">dev</span>='hd'/&gt;
      &lt;/<span style="color: #ffd700;">os</span>&gt;

      &lt;<span style="color: #ffd700;">features</span>&gt;
        &lt;<span style="color: #ffd700;">acpi</span>/&gt;
      &lt;/<span style="color: #ffd700;">features</span>&gt;

      &lt;<span style="color: #ffd700;">clock</span> <span style="color: #ff8700;">offset</span>='utc'/&gt;
      &lt;<span style="color: #ffd700;">on_poweroff</span>&gt;destroy&lt;/<span style="color: #ffd700;">on_poweroff</span>&gt;
      &lt;<span style="color: #ffd700;">on_reboot</span>&gt;restart&lt;/<span style="color: #ffd700;">on_reboot</span>&gt;
      &lt;<span style="color: #ffd700;">on_crash</span>&gt;destroy&lt;/<span style="color: #ffd700;">on_crash</span>&gt;

      &lt;<span style="color: #ffd700;">devices</span>&gt;
        &lt;<span style="color: #ffd700;">emulator</span>&gt;/usr/bin/kvm&lt;/<span style="color: #ffd700;">emulator</span>&gt;

        &lt;<span style="color: #ffd700;">disk</span> <span style="color: #ff8700;">type</span>=<span style="color: #ff4ea3;">"file"</span> <span style="color: #ff8700;">device</span>=<span style="color: #ff4ea3;">"disk"</span>&gt;
          &lt;<span style="color: #ffd700;">driver</span> <span style="color: #ff8700;">name</span>=<span style="color: #ff4ea3;">"qemu"</span> <span style="color: #ff8700;">type</span>=<span style="color: #ff4ea3;">"qcow2"</span>/&gt;
          &lt;<span style="color: #ffd700;">source</span> <span style="color: #ff8700;">file</span>=<span style="color: #ff4ea3;">"/home/compute/your_vm.img"</span>/&gt;
          &lt;<span style="color: #ffd700;">target</span> <span style="color: #ff8700;">dev</span>=<span style="color: #ff4ea3;">"vda"</span> <span style="color: #ff8700;">bus</span>=<span style="color: #ff4ea3;">"virtio"</span>/&gt;
          &lt;<span style="color: #ffd700;">address</span> <span style="color: #ff8700;">type</span>=<span style="color: #ff4ea3;">"pci"</span> <span style="color: #ff8700;">domain</span>=<span style="color: #ff4ea3;">"0x0000"</span> <span style="color: #ff8700;">bus</span>=<span style="color: #ff4ea3;">"0x00"</span> <span style="color: #ff8700;">slot</span>=<span style="color: #ff4ea3;">"0x04"</span> <span style="color: #ff8700;">function</span>=<span style="color: #ff4ea3;">"0x0"</span>/&gt;
        &lt;/<span style="color: #ffd700;">disk</span>&gt;

        &lt;<span style="color: #ffd700;">interface</span> <span style="color: #ff8700;">type</span>='bridge'&gt;
          &lt;<span style="color: #ffd700;">source</span> <span style="color: #ff8700;">bridge</span>='bridge-eth6'/&gt;
          &lt;<span style="color: #ffd700;">target</span> <span style="color: #ff8700;">dev</span>='pengvnet0'/&gt;
          &lt;<span style="color: #ffd700;">model</span> <span style="color: #ff8700;">type</span>='virtio'/&gt;
          &lt;<span style="color: #ffd700;">mac</span> <span style="color: #ff8700;">address</span>=<span style="color: #ff4ea3;">"00:00:A3:B0:56:10"</span>/&gt;
        &lt;/<span style="color: #ffd700;">interface</span>&gt;

        &lt;<span style="color: #ffd700;">controller</span> <span style="color: #ff8700;">type</span>=<span style="color: #ff4ea3;">"ide"</span> <span style="color: #ff8700;">index</span>=<span style="color: #ff4ea3;">"0"</span>&gt;
          &lt;<span style="color: #ffd700;">address</span> <span style="color: #ff8700;">type</span>=<span style="color: #ff4ea3;">"pci"</span> <span style="color: #ff8700;">domain</span>=<span style="color: #ff4ea3;">"0x0000"</span> <span style="color: #ff8700;">bus</span>=<span style="color: #ff4ea3;">"0x00"</span> <span style="color: #ff8700;">slot</span>=<span style="color: #ff4ea3;">"0x01"</span> <span style="color: #ff8700;">function</span>=<span style="color: #ff4ea3;">"0x1"</span>/&gt;
        &lt;/<span style="color: #ffd700;">controller</span>&gt;
        &lt;<span style="color: #ffd700;">input</span> <span style="color: #ff8700;">type</span>='mouse' <span style="color: #ff8700;">bus</span>='ps2'/&gt;
        &lt;<span style="color: #ffd700;">graphics</span> <span style="color: #ff8700;">type</span>='vnc' <span style="color: #ff8700;">port</span>='-1' <span style="color: #ff8700;">autoport</span>=<span style="color: #ff4ea3;">"yes"</span> <span style="color: #ff8700;">listen</span>='0.0.0.0'/&gt;
        &lt;<span style="color: #ffd700;">console</span> <span style="color: #ff8700;">type</span>='pty'&gt;
          &lt;<span style="color: #ffd700;">target</span> <span style="color: #ff8700;">port</span>='0'/&gt;
        &lt;/<span style="color: #ffd700;">console</span>&gt;

      &lt;/<span style="color: #ffd700;">devices</span>&gt;
    &lt;/<span style="color: #ffd700;">domain</span>&gt;
</pre>
</div>

<p>
直接使用 <code>virsh create XXX.xml</code> 就可以拉起一台虚拟机。删除可以这样：
</p>
<div class="org-src-container">
<pre class="src src-sh">    virsh destroy ras-test
    virsh undefine ras-test
</pre>
</div>

<p>
每个虚拟机都需要一个xml文件。把上面xml保存为 <code>base.xml</code> ，然后用
python基于它生成20份xml。python脚本如下：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> bs4 <span style="color: #a1db00;">import</span> BeautifulSoup

    <span style="color: #a1db00;">for</span> i <span style="color: #a1db00;">in</span> <span style="color: #d18aff;">range</span>(1,21):
        <span style="color: #a1db00;">with</span> <span style="color: #d18aff;">open</span>(<span style="color: #ff4ea3;">'base.xml'</span>) <span style="color: #a1db00;">as</span> f:
            <span style="color: #ff8700;">soup</span> = BeautifulSoup(f.read(), <span style="color: #ff4ea3;">'xml'</span>)
            soup.find(<span style="color: #ff4ea3;">'name'</span>)<span style="color: #ff8700;">.string</span> = <span style="color: #ff4ea3;">'vm-%s'</span> % i
            soup.find(<span style="color: #ff4ea3;">'devices'</span>).find(<span style="color: #ff4ea3;">'disk'</span>).find(<span style="color: #ff4ea3;">'source'</span>)[<span style="color: #ff4ea3;">'file'</span>] = <span style="color: #ff4ea3;">'/home/compute/your_vm_%s.img'</span> % i
            soup.find(<span style="color: #ff4ea3;">'devices'</span>).find(<span style="color: #ff4ea3;">'interface'</span>).find(<span style="color: #ff4ea3;">'target'</span>)[<span style="color: #ff4ea3;">'dev'</span>] = <span style="color: #ff4ea3;">'ras-vnet-%s'</span> % i
            <span style="color: #ff8700;">temp</span> = <span style="color: #d18aff;">hex</span>(i).split(<span style="color: #ff4ea3;">'x'</span>)[-1]
            <span style="color: #ff8700;">temp</span> = temp.zfill(2)
            soup.find(<span style="color: #ff4ea3;">'devices'</span>).find(<span style="color: #ff4ea3;">'interface'</span>).find(<span style="color: #ff4ea3;">'mac'</span>)[<span style="color: #ff4ea3;">'address'</span>] = <span style="color: #ff4ea3;">'00:00:A3:B0:56:%s'</span> % temp

            <span style="color: #ff8700;">out</span> = <span style="color: #d18aff;">open</span>(<span style="color: #ff4ea3;">'ras-%s.xml'</span> % i, <span style="color: #ff4ea3;">'w'</span>)
            out.write(<span style="color: #d18aff;">str</span>(soup))
            out.close()
</pre>
</div>

<p>
另外，xml文件中的 <code>your_vm.img</code> 是拉起虚拟机的镜像，qcow2格式。
20台机器，需要20个这样的镜像，也就是说需要copy20次。
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #a1db00;">for</span> i<span style="color: #a1db00;"> in</span> {1..20}
    <span style="color: #a1db00;">do</span>
        cp -af your_vm.img your_vm_$<span style="color: #ff8700;">i</span>.img
    <span style="color: #a1db00;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga82d4e6" class="outline-2">
<h2 id="orga82d4e6"><span class="section-number-2">2</span> 网络设置</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org15b2a1b" class="outline-3">
<h3 id="org15b2a1b"><span class="section-number-3">2.1</span> 网络拓扑</h3>
<div class="outline-text-3" id="text-2-1">
<p>
测试环境需要的是万兆网络。一体机上有一个万兆网卡。于是我们的模型应
该是这样的：
</p>
<pre class="example">
           up1   up2   up3   up4                     Input Traffic
            ^     ^     ^     ^                            |
            |     |     |     |                            |
            |     |     |     |                            |
            v     v     v     v                            v
     +-----+--+--+--+--+--+--+--+-------------------------+--+------------------+
     |     |  |  |  |  |  |  |  | 1G/s                    |  | 10G/s            |
     |     ++-+  ++-+  ++-+  ++-+ eth[0~3]                ++-+ eth6             |
     |      ^     ^     ^     ^                            |                    |
     |      |     |     |     |                            |                    |
     |      |     |     |     |            +---------------+---------------+    |
     |      |     |     |     |            |                               |    |
     |      |     |     |     +-----------&gt;+                               |    |
     |      |     |     |                  |                               |    |
     |      |     |     +-----------------&gt;+                               |    |
     |      |     |                        |           bridge-eth6         |    |
     |      |     +-----------------------&gt;+                               |    |
     |      |                              |                               |    |
     |      +-----------------------------&gt;+                               |    |
     |                                     +-+-------+-------+-------+-----+    |
     |                                       |       |       |       |          |
     |                                      ++-+    ++-+    ++-+    ++-+        |
     |                                      |  |    |  |    |  |    |  |  ...   |
     |                                      +--+    +--+    +--+    +--+        |
     |                                      vm1     vm2     vm3     vm5         |
     +--------------------------------------------------------------------------+
</pre>

<p>
一体机的万兆网卡 <code>eth6</code> 和4个千兆网卡 <code>eth0, eth1, eth2, eth3</code> 以及
拉起虚拟机的网卡都连接在一个名为 <code>bridge-eth6</code> 的网桥上。它们就全都
在一个软件虚拟出来的交换机（就是 <code>bridge-eth6</code> ）上了。
</p>

<p>
可能需要的命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#26032;&#24314;&#32593;&#26725;</span>
     brctl addbr bridge-eth6

     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#25226;&#32593;&#21345;eth6&#28155;&#21152;&#21040;&#32593;&#26725;&#19978;</span>
     brctl addif bridge-eth6 eth6
     brctl addif bridge-eth6 eth0
     brctl addif bridge-eth6 eth1
     brctl addif bridge-eth6 eth2
     brctl addif bridge-eth6 eth3

     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#26597;&#35810;&#32593;&#26725;</span>
     brctl show

     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#25226;&#32593;&#21345;&#20174;&#26725;&#19978;&#21024;&#38500; </span>
     brctl delif bridge-eth6 eth3
</pre>
</div>

<p>
下面的脚本可以根据一个网卡，新建网桥，把原网卡的ip设置到新的网桥设备
并配置好路由：
</p>
<div class="org-src-container">
<pre class="src src-sh">     <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/bin/bash</span>
     moveHostIntf(){
         <span style="color: #ff8700;">IFINDEX</span>=$<span style="color: #ff8700;">1</span>
         <span style="color: #ff8700;">BRIDGE</span>=bridge-$<span style="color: #ff8700;">IFINDEX</span>

         bridge link show|cut -d<span style="color: #ff4ea3;">\ </span> -f 2|grep <span style="color: #ff4ea3;">"^$IFINDEX\$"</span>
         <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">brctl show $BRIDGE | grep "\&lt;$IFINDEX\&gt;" &gt;/dev/null</span>
         <span style="color: #a1db00;">if</span> [ $<span style="color: #ff8700;">?</span> = 0 ];<span style="color: #a1db00;">then</span>
             <span style="color: #d18aff;">echo</span> <span style="color: #ff4ea3;">"host interface $IFINDEX already in bridge $BRIDGE"</span>
             <span style="color: #a1db00;">return</span> 1
         <span style="color: #a1db00;">fi</span>

         <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">save route table related to this interface</span>
         <span style="color: #ff8700;">myRoute</span>=$(ip route show scope global dev $<span style="color: #ff8700;">IFINDEX</span> | <span style="color: #a1db00;">while </span><span style="color: #d18aff;">read</span> dst via gw;<span style="color: #a1db00;">do if</span> [ <span style="color: #ff4ea3;">"$via"</span> = <span style="color: #ff4ea3;">"via"</span> ]; <span style="color: #a1db00;">then </span><span style="color: #d18aff;">echo</span> <span style="color: #ff4ea3;">"route add -net $dst gw $gw"</span>;<span style="color: #a1db00;">fi</span>;<span style="color: #a1db00;">done</span>;)

         <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">save IP of this interface</span>
         <span style="color: #ff8700;">myIp</span>=$(getIpAddr $<span style="color: #ff8700;">IFINDEX</span>)


         brctl addbr $<span style="color: #ff8700;">BRIDGE</span>
         ip addr flush dev $<span style="color: #ff8700;">IFINDEX</span>
         brctl addif $<span style="color: #ff8700;">BRIDGE</span> $<span style="color: #ff8700;">IFINDEX</span>

         <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">restore IP of the old interface to new one</span>
         ifconfig $<span style="color: #ff8700;">BRIDGE</span> $<span style="color: #ff8700;">myIp</span>

         <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">restore route table related to this interface</span>
         <span style="color: #a1db00;">for </span><span style="color: #d18aff;">r</span><span style="color: #a1db00;"> in</span> <span style="color: #ff4ea3;">"$myRoute"</span>;<span style="color: #a1db00;">do</span>
             $<span style="color: #ff8700;">r</span>
         <span style="color: #a1db00;">done</span>

     }

     getIpAddr(){
         ip addr show $<span style="color: #ff8700;">1</span>|grep -o <span style="color: #ff4ea3;">"inet [^[:space:]]*"</span>|cut -d<span style="color: #ff4ea3;">\ </span> -f2
     }


     moveHostIntf $<span style="color: #ff8700;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f9fa5b" class="outline-3">
<h3 id="org8f9fa5b"><span class="section-number-3">2.2</span> 拉起的虚拟机的ip设置</h3>
<div class="outline-text-3" id="text-2-2">
<p>
拉起的机器，希望它们都有静态ip。 <code>libvirsh</code> 默认使用 <code>dnamasq</code> 提供
dhcp服务。这样配置 <code>/etc/dnsmasq.conf</code> ：
</p>
<div class="org-src-container">
<pre class="src src-conf-space">     <span style="color: #ff8700;">strict-order</span>
     <span style="color: #ff8700;">user=libvirt-dnsmasq</span>
     <span style="color: #ff8700;">except-interface=lo,eth0,eth1</span>

     <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">bind-dynamic</span>
     <span style="color: #ff8700;">bind-interfaces</span>
     <span style="color: #ff8700;">interface=bridge-eth6</span>
     <span style="color: #ff8700;">listen-address=192.168.1.1</span>

     <span style="color: #ff8700;">dhcp-range=192.168.1.2,192.168.1.21</span>
     <span style="color: #ff8700;">dhcp-no-override</span>
     <span style="color: #ff8700;">dhcp-leasefile=/var/lib/libvirt/dnsmasq/default.leases</span>
     <span style="color: #ff8700;">dhcp-lease-max=253</span>
     <span style="color: #ff8700;">dhcp-hostsfile=/var/lib/libvirt/dnsmasq/default.hostsfile</span>
     <span style="color: #ff8700;">addn-hosts=/var/lib/libvirt/dnsmasq/default.addnhosts</span>

     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:01,192.168.1.2</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:02,192.168.1.3</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:03,192.168.1.4</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:04,192.168.1.5</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:05,192.168.1.6</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:06,192.168.1.7</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:07,192.168.1.8</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:08,192.168.1.9</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:09,192.168.1.10</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:0a,192.168.1.11</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:0b,192.168.1.12</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:0c,192.168.1.13</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:0d,192.168.1.14</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:0e,192.168.1.15</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:0f,192.168.1.16</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:10,192.168.1.17</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:11,192.168.1.18</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:12,192.168.1.19</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:13,192.168.1.20</span>
     <span style="color: #ff8700;">dhcp-host=00:00:A3:B0:56:14,192.168.1.21</span>
</pre>
</div>
<p>
最后是绑定了mac和ip的。而这些mac是在前文的xml中设置的，写死了。拉起
机器前，可以kill掉所有dnsmasq进程，然后手动启动一个 <code>dnsmasq</code> 。
</p>
</div>
</div>
</div>

<div id="outline-container-org71528e0" class="outline-2">
<h2 id="org71528e0"><span class="section-number-2">3</span> 瓶颈</h2>
<div class="outline-text-2" id="text-3">
<p>
经测试发现，该模型达不到万兆的测试要求。
</p>

<p>
实际测试中，虽然eth6是一个万兆网卡，添加到网桥上后，实际测试就只有千
兆的带宽了。
</p>

<p>
把eth6从网桥上删除，直接使用确实有万兆的带宽。
</p>

<p>
瓶颈应该是在网桥上。我暂时还没找到解决办法。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>